#### Subject of this NoteBook:  
#### Authored by:                   Hafiz Muhammad Asif
#### Contact:                       github profile link "OR" email

In [1]:
# pip install notebook

### Data Collection & Wrangling

## 1. Data Collection / Creation

In [2]:
# Import Libraries
import pandas as pd
import numpy as np
import pandas as pd

In [3]:
# List
Data = {
        'Name'  : ['Ali', 'Alina', 'Elsa', 'Akbar', 'Jon', 'Tim', 'Huda'],
        'Age'   : [12,15,17,22,21,20,19],
        'Gender': ['M','F', 'F', 'M', 'M', 'M', 'F'],
        'Marks' : [90,'NaN',70,'NaN', 72.2, 80.3,'NaN']
}

### Convert into Data Frame

In [4]:
df = pd.DataFrame(Data)
df

    Name  Age Gender Marks
0    Ali   12      M    90
1  Alina   15      F   NaN
2   Elsa   17      F    70
3  Akbar   22      M   NaN
4    Jon   21      M  72.2
5    Tim   20      M  80.3
6   Huda   19      F   NaN

## 2. Data Assessment

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
 3   Marks   7 non-null      object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [6]:
df.dtypes

Name      object
Age        int64
Gender    object
Marks     object
dtype: object

In [7]:
df.head()

    Name  Age Gender Marks
0    Ali   12      M    90
1  Alina   15      F   NaN
2   Elsa   17      F    70
3  Akbar   22      M   NaN
4    Jon   21      M  72.2

In [8]:
df.tail()

    Name  Age Gender Marks
2   Elsa   17      F    70
3  Akbar   22      M   NaN
4    Jon   21      M  72.2
5    Tim   20      M  80.3
6   Huda   19      F   NaN

In [9]:
df.head(2)

    Name  Age Gender Marks
0    Ali   12      M    90
1  Alina   15      F   NaN

In [10]:
df.sample()

  Name  Age Gender Marks
0  Ali   12      M    90

## 3. Data Cleaning

In [11]:
new_df = df.replace("NaN", np.nan)
print(new_df)

    Name  Age Gender  Marks
0    Ali   12      M   90.0
1  Alina   15      F    NaN
2   Elsa   17      F   70.0
3  Akbar   22      M    NaN
4    Jon   21      M   72.2
5    Tim   20      M   80.3
6   Huda   19      F    NaN

In [12]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
 3   Marks   4 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 352.0+ bytes

### Dealing with Missing Values

In [13]:
# Count Average
c = avg = 0
for ele in df ['Marks']:
    if str(ele).isnumeric():
        c += 1
        avg += ele
avg /= c

In [14]:
# Count Average
# marks = Data['Marks']
# avg =np.nanmean(marks)
# new_df = df.replace("NaN", np.nan)
# avg = sum(marks) / len(marks)
# print("Average of marks:", avg)

In [15]:
## Replace Missing Values
df = df.replace(to_replace = "NaN", value = avg)
df

    Name  Age Gender  Marks
0    Ali   12      M   90.0
1  Alina   15      F   80.0
2   Elsa   17      F   70.0
3  Akbar   22      M   80.0
4    Jon   21      M   72.2
5    Tim   20      M   80.3
6   Huda   19      F   80.0

In [16]:
new_df

    Name  Age Gender  Marks
0    Ali   12      M   90.0
1  Alina   15      F    NaN
2   Elsa   17      F   70.0
3  Akbar   22      M    NaN
4    Jon   21      M   72.2
5    Tim   20      M   80.3
6   Huda   19      F    NaN

In [17]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
 3   Marks   4 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 352.0+ bytes

In [18]:
new_df.mean()

C:\Users\Al HAfiz Enterprises\AppData\Local\Temp\ipykernel_10972\3764789720.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  new_df.mean()

Age      18.000
Marks    78.125
dtype: float64

## Specific Column

In [19]:
new_df['Age'].mean()

18.0

## Double

In [20]:
new_df[['Age', 'Marks']].mean()

Age      18.000
Marks    78.125
dtype: float64

In [21]:
new_df.mean(axis=1, skipna=False)

C:\Users\Al HAfiz Enterprises\AppData\Local\Temp\ipykernel_10972\2355539557.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  new_df.mean(axis=1, skipna=False)

0    51.00
1      NaN
2    43.50
3      NaN
4    46.60
5    50.15
6      NaN
dtype: float64

#### Reshaping the Data / Numeric Conversion Gender wise / Mapping

In [22]:
df['Gender'] = df['Gender'].map({'M': 0, 'F': 1,}).astype(float)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      float64
 3   Marks   7 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 352.0+ bytes

## Filtering

In [24]:
higher_std = df[df['Marks'] >= 80]

In [25]:
higher_std

    Name  Age  Gender  Marks
0    Ali   12     0.0   90.0
1  Alina   15     1.0   80.0
3  Akbar   22     0.0   80.0
5    Tim   20     0.0   80.3
6   Huda   19     1.0   80.0

## Droping / Deleting the Columns

In [26]:
new_drp = df.drop(['Gender', 'Age'], axis=1)

In [27]:
new_drp

    Name  Marks
0    Ali   90.0
1  Alina   80.0
2   Elsa   70.0
3  Akbar   80.0
4    Jon   72.2
5    Tim   80.3
6   Huda   80.0

## Series Create Empty Series

In [28]:
ser = pd.Series()
print(ser)

Series([], dtype: float64)

C:\Users\Al HAfiz Enterprises\AppData\Local\Temp\ipykernel_10972\3252700383.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()

## Simple array

In [29]:
data = np.array(['a', 'e','i', 'o','u'])
ser = pd.Series(data) 
print(ser)

0    a
1    e
2    i
3    o
4    u
dtype: object

## DataFrame

In [30]:
df =pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

## Creating list of strings

In [31]:
lst = ['we', 'are', 'creating', 'DataFrame']
df = pd.DataFrame(lst)
print(df)

           0
0         we
1        are
2   creating
3  DataFrame

In [ ]:
// nbconvert conversion of pdf ?

In [38]:
pip install latex

Collecting latexNote: you may need to restart the kernel to use updated packages.

  Downloading latex-0.7.0.tar.gz (6.5 kB)
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Collecting tempdir (from latex)
  Downloading tempdir-0.7.1.tar.gz (5.9 kB)
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Collecting data (from latex)
  Downloading data-0.4.tar.gz (7.0 kB)
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Collecting future (from latex)
  Downloading future-0.18.3.tar.gz (840 kB)
     -------------------------------------- 840.9/840.9 kB 3.0 MB/s eta 0:00:00
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Collecting shutilwhich (from latex)
  Downloading shutilwhich-1.1.0.tar.gz (2.3 kB)
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Requirement already satisfied: six in c:\users\al hafiz enterprises\appdata\local\programs\python\python39\lib\site-packages (from data->latex) (1.16.0)
Requirement already satisfied: decorator in c:\users\al hafiz enterprises\appdata\local\programs\python\python39\lib\site-packages (from data->latex) (5.1.1)
Collecting funcsigs (from data->latex)
  Downloading funcsigs-1.0.2-py2.py3-none-any.whl (17 kB)
Building wheels for collected packages: latex, data, future, shutilwhich, tempdir
  Building wheel for latex (pyproject.toml): started
  Building wheel for latex (pyproject.toml): finished with status 'done'
  Created wheel for latex: filename=latex-0.7.0-py3-none-any.whl size=7610 sha256=b284fb4b585bcd3df62778c64df14e6fcdc69b28d79625bdaf3a1607bea7dcae
  Stored in directory: c:\users\al hafiz enterprises\appdata\local\pip\cache\wheels\94\84\e5\5ce582523fd479d00356867953085a67c47fbbc86506aa92f8
  Building wheel for data (pyproject.toml): started
  Building wheel for data (pyproject.toml): finished with status 'done'
  Created wheel for data: filename=data-0.4-py3-none-any.whl size=7259 sha256=5e11b10d56af687c0aca2c2f66028b39ce762c6fb5adbfd2dd527a43301e43b1
  Stored in directory: c:\users\al hafiz enterprises\appdata\local\pip\cache\wheels\8a\0b\a3\37ca07d5a2838bba2e475e8090455e40b94631bd57a99a35f4
  Building wheel for future (pyproject.toml): started
  Building wheel for future (pyproject.toml): finished with status 'done'
  Created wheel for future: filename=future-0.18.3-py3-none-any.whl size=492053 sha256=18c44f304cd5402bd63cf42362a8b611748651474bffe21a1bb6f72eb10d6225
  Stored in directory: c:\users\al hafiz enterprises\appdata\local\pip\cache\wheels\bf\5d\6a\2e53874f7ec4e2bede522385439531fafec8fafe005b5c3d1b
  Building wheel for shutilwhich (pyproject.toml): started
  Building wheel for shutilwhich (pyproject.toml): finished with status 'done'
  Created wheel for shutilwhich: filename=shutilwhich-1.1.0-py3-none-any.whl size=2780 sha256=d4942b47c7d10c0e8de372c2453564475219225bf15c185ae4e1df4685f792e8
  Stored in directory: c:\users\al hafiz enterprises\appdata\local\pip\cache\wheels\84\c7\f5\fed66dce1ed897b44e0da776b6a592dfad0a70f7dd61f73a9d
  Building wheel for tempdir (pyproject.toml): started
  Building wheel for tempdir (pyproject.toml): finished with status 'done'
  Created wheel for tempdir: filename=tempdir-0.7.1-py3-none-any.whl size=2207 sha256=fed796ee355c50a1438059cf3f6109e16cd671e899e6735c058c152f4c4a59da
  Stored in directory: c:\users\al hafiz enterprises\appdata\local\pip\cache\wheels\31\7b\e3\af441c2f71a48c30809aada978c1433b163a0747e73b5805ca
Successfully built latex data future shutilwhich tempdir
Installing collected packages: tempdir, shutilwhich, funcsigs, future, data, latex
Successfully installed data-0.4 funcsigs-1.0.2 future-0.18.3 latex-0.7.0 shutilwhich-1.1.0 tempdir-0.7.1

In [45]:
import nbformat